import pandas as pd
import random


# подключение файла№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№
data= pd.read_csv("./Data/labeled.csv", sep=",")

print("\n=====================================\n")
print( f"Всего комментов,колонок: {data.shape}")
data["toxic"]=data["toxic"].apply(int)
print(data["toxic"].value_counts())
print("\n=====================================\n")
# print("один из комментов")
# print(data[data["toxic"] == 0].iloc[0]['comment'])

#Разделение выбороk№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№

random.seed(42)# Фиксируем seed для воспроизводимости
indices = list(data.index)
random.shuffle(indices)

test_data = data.loc[indices[:500]]
train_data = data.loc[indices[500:]]

print(f"Тренировочная выборка: {len(train_data)} примеров")
print(f"Тестовая выборка: {len(test_data)} примеров")
print("\nРаспределение в тестовой выборке:")
print(test_data["toxic"].value_counts())
print("\nРаспределение в тренировочной выборке:")
print(train_data["toxic"].value_counts())
print("\n=====================================\n")


#Функция токенизации№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№

def tokenize_advanced(text):

    text = text.lower()


    punctuation = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~0123456789'
    for char in punctuation:
        text = text.replace(char, ' ')


    tokens = text.split()


    stop_words = {
        'и','э','эй', 'в', 'во', 'не', 'что', 'он', 'на', 'я', 'с', 'со', 'как', 'а',
        'то', 'все', 'она', 'так', 'его', 'но', 'да', 'ты', 'к', 'у', 'же',
        'вы', 'за', 'бы', 'по', 'только', 'ее', 'мне', 'было', 'вот', 'от',
        'меня', 'еще', 'нет', 'о', 'из', 'ему', 'теперь', 'когда', 'даже',
        'ну', 'вдруг', 'ли', 'если', 'уже', 'или', 'ни', 'быть', 'был', 'него',
        'до', 'вас', 'нибудь', 'опять', 'уж', 'вам', 'ведь', 'там', 'потом',
        'себя', 'ничего', 'ей', 'может', 'они', 'тут', 'где', 'есть', 'надо',
        'ней', 'для', 'мы', 'тебя', 'их', 'чем', 'была', 'сам', 'чтоб', 'без',
        'будто', 'чего', 'раз', 'тоже', 'себе', 'под', 'будет', 'ж', 'тогда',
        'кто', 'этот', 'того', 'потому', 'этого', 'какой', 'совсем', 'ним',
        'здесь', 'этом', 'один', 'почти', 'мой', 'тем', 'чтобы', 'нее', 'сейчас',
        'были', 'куда', 'зачем', 'всех', 'никогда', 'можно', 'при', 'наконец',
        'два', 'об', 'другой', 'хоть', 'после', 'над', 'больше', 'тот', 'через',
        'эти', 'нас', 'про', 'всего', 'них', 'какая', 'много', 'разве', 'три',
        'эту', 'моя', 'впрочем', 'хорошо', 'свою', 'этой', 'перед', 'иногда',
        'лучше', 'чуть', 'том', 'нельзя', 'такой', 'им', 'более', 'всегда',
        'конечно', 'всю', 'между'
    }
    tokens = [word for word in tokens if word not in stop_words]


    #стемминг
    lemmas = []
    for word in tokens:

        if word.endswith(('то', 'ка', 'либо', 'нибудь')):
            word = word[:-2]

        if word.endswith(('ин', 'ын', 'ов', 'ев', 'ая', 'ое', 'ой', 'ый', 'ее', 'яя', 'ий')):
            word = word[:-2]

        if word.endswith(('а', 'я', 'о', 'е', 'ы', 'и', 'у', 'ю')):
            word = word[:-1]

        lemmas.append(word)

    return lemmas

random.seed()
print("Токенезированный случайный коммент")
print(tokenize_advanced(data[data["toxic"] == 0].iloc[random.randint(0,500)]['comment']))
print("\n=====================================\n")

#Векторизация


#Создание и обучение модели


# проверка точности модели













